# MaxNumberOfCircuits Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalEquipment..::..MaxNumberOfCircuits Property
ElectricalEquipment Class See Also
---
The maximum number of circuits for switchboard. The quantity of circuits can be assigned to switchboard through breaker.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public int MaxNumberOfCircuits { get; set; }
```

Visual Basic
---
```text
Public Property MaxNumberOfCircuits As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int MaxNumberOfCircuits {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input max number of circuits value is invalid for switchboard. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The electrical equipment is not a switchboard equipment. |

# See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace